app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Ivory Salas', 'huvuxyhun@mailinator.com', '$2y$12$jTc3Q8TUUGjoo85nc9bBVe8beHsF0/IlvJWRDlTWk2ypbDAbuCho.', '2023-11-18 20:41:06', '2023-11-18 20:41:06')
insert into `files` (`name`, `is_folder`, `parent_id`, `_lft`, `_rgt`, `created_by`, `updated_by`, `updated_at`, `created_at`) values ('huvuxyhun@mailinator.com', 1, '', 1, 2, 1, 1, '2023-11-18 20:41:06', '2023-11-18 20:41:06')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|lowercase|email|max:255|unique:'.User::class,
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);

        event(new Registered($user));

        Auth::login($user);
        $file = new File();
        $file->name = $user->email;
        $file->is_folder = 1;
        $file->makeRoot()->save();