app/Http/Requests/parentBaseIdRequest.php

select * from `files` where `id` is null and `files`.`deleted_at` is null limit 1
---
  public function authorize(): bool
  {
    $this->parent = File::where('id', $this->input('parent_id'))->first();