app/Http/Controllers/FileController.php

  private function getRoot()
  {
    return File::query()->whereIsRoot()->where('created_by', Auth::user()->id)->firstOrFail();
---
select * from `files` where `created_by` = 7 limit 1